# Напишите программу, которая принимает на вход цифру, обозначающую день недели?
# и проверяет, является ли этот день выходным.

daynumber = int(input('Введите номер дня недели: '))
if daynumber >= 6:
    print('Это выходной')
else:
    print('Это будний день')

# Напишите программу для. проверки истинности утверждения 
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

